; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v4)
		(pred_2 ?v7)
		(pred_3 ?v5)
		(pred_1 ?v5)
		(pred_4 ?v7 ?v5)
		(pred_6)
		(pred_5 ?v7))

   (:action op_3
       :parameters  (?v1 ?v8)
       :precondition (and (not-eq ?v1 ?v8) 
                          (pred_3 ?v1) (pred_3 ?v8) (pred_1 ?v1))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v1))))


   (:action op_2
       :parameters (?v6 ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_3 ?v2)
			    (pred_4 ?v6 ?v2) (pred_1 ?v2) (pred_6))
       :effect (and (pred_5 ?v6)
		    (not (pred_4 ?v6 ?v2)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v6  ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_3 ?v2)
			    (pred_5 ?v6) (pred_1 ?v2))
       :effect (and (pred_4 ?v6 ?v2)
		    (pred_6)
		    (not (pred_5 ?v6)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_03 obj_06 obj_01 
          obj_04 obj_05 obj_02 
)
(:init
(pred_3 obj_03)
(pred_3 obj_06)
(pred_3 obj_01)
(pred_2 obj_04)
(pred_2 obj_05)
(pred_2 obj_02)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_06)
(pred_6)
(pred_4 obj_04 obj_03)
(pred_4 obj_05 obj_06)
(pred_4 obj_02 obj_06)
(pred_1 obj_01)
)
(:goal
(and
(pred_4 obj_04 obj_03)
(pred_4 obj_05 obj_06)
(pred_4 obj_02 obj_01)
)
)

(:constraints
  (sometime-before  (pred_4 obj_02 obj_01) (pred_1 obj_03))
)
)

; plan
1. (op_3 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 2 of 3
2. (op_2 obj_02 obj_06)
   deleted: (pred_4 obj_02 obj_06) (pred_6)
   added: (pred_5 obj_02)
   goals met: 2 of 3
3. (op_3 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_03)
   goals met: 2 of 3
4. (op_1 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_4 obj_02 obj_03) (pred_6)
   goals met: 2 of 3
5. (op_2 obj_04 obj_03)
   deleted: (pred_4 obj_04 obj_03) (pred_6)
   added: (pred_5 obj_04)
   goals met: 1 of 3
6. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 1 of 3
7. (op_1 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_4 obj_04 obj_01) (pred_6)
   goals met: 1 of 3
8. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 1 of 3
9. (op_2 obj_02 obj_03)
   deleted: (pred_4 obj_02 obj_03) (pred_6)
   added: (pred_5 obj_02)
   goals met: 1 of 3
10. (op_3 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 1 of 3
11. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_4 obj_02 obj_01) (pred_6)
   goals met: 2 of 3
12. (op_2 obj_04 obj_01)
   deleted: (pred_4 obj_04 obj_01) (pred_6)
   added: (pred_5 obj_04)
   goals met: 2 of 3
13. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 2 of 3
14. (op_1 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_4 obj_04 obj_03) (pred_6)
   goals met: 3 of 3
